//
// Created by semyo on 06.07.2026.
//

#ifndef CPPYTHON_BINOPNODE_H
#define CPPYTHON_BINOPNODE_H

#include "../ASTNode.h"

/**
 * @class BinOpNode
 * @brief Представляет узел бинарной операции в абстрактном синтаксическом дереве (AST) интерпретатора языка программирования.
 *
 * BinOpNode обрабатывает бинарные операции, такие как арифметические выражения, сравнения или конкатенация строк.
 * Он принимает два дочерних узла (левый и правый) и оператор, и вычисляет их для получения результата.
 *
 * @details
 * Класс поддерживает вычисление (`eval`) и строковое представление (`toString`) бинарных операций.
 * Поддерживаемые операции включают арифметические (`+`, `-`, `*`, `/`, `%`, `**`, `//`), сравнения (`==`, `!=`, `>`, `>=`, `<`, `<=`),
 * и строковые операции. Узел вычисляется путем рекурсивного вычисления левого и правого дочерних узлов
 * и применения указанного оператора. Если встречается неподдерживаемая операция или комбинация типов операндов,
 * генерируются соответствующие ошибки.
 *
 * Метод `eval` обеспечивает правильную обработку типов (например, числовых, строковых или смешанных) и делегирует конкретные
 * поведения вспомогательным методам, таким как `evalTwoNumbers`, `evalTwoStrings` и `evalNumAndString`.
 */
class BinOpNode final : public ASTNode {

    std::shared_ptr<ASTNode> left;
    QString op; // "+", "-", "=", "/", "%", "*", "**", "//", "=="
    std::shared_ptr<ASTNode> right;

public:

    BinOpNode(std::shared_ptr<ASTNode> left, QString  op, std::shared_ptr<ASTNode> right);

    [[nodiscard]] QString toString() const override;

    /**
     * @brief Вычисляет бинарную операцию, представленную текущим узлом.
     *
     * Этот метод рекурсивно вычисляет левый и правый дочерние узлы для получения их значений,
     * а затем применяет бинарную операцию, связанную с этим узлом (например, арифметическую, сравнение),
     * на основе строки оператора. Метод поддерживает операции над числовыми, строковыми или смешанными типами.
     * Выбрасывает исключение, если операция не поддерживается для данных типов операндов.
     *
     * @param env Среда выполнения, содержащая привязки переменных и состояние.
     * @return Результат вычисления бинарной операции. Тип результата зависит от операции
     *         и операндов (например, числовой результат для арифметических операций, строковый результат для строковых операций).
     * @throws std::runtime_error Если операция не поддерживается для данных типов операндов.
     */
    [[nodiscard]] Value eval(EnvPtr env) const override;

    /**
     * @enum Operation
     * @brief Представляет операции, которые могут быть выполнены в бинарном узле AST.
     *
     * Перечисление `Operation` определяет набор поддерживаемых бинарных операций,
     * таких как арифметические операции, операции сравнения и операции модификации.
     * Оно используется для представления и обработки этих операций в синтаксическом анализе
     * и вычислении узлов AST.
     *
     * @details
     * Операции разбиваются на несколько категорий:
     * - **Арифметические операции**: Add, Subtract, Multiply, Divide, Modulo, IntDivide, Power.
     * - **Операции сравнения**: Equal, NotEqual, Greater, GreaterEqual, Less, LessEqual.
     * Эти операции могут быть применены к числовым значениям, а также могут включать
     * дополнительную проверку на деление на ноль или другие ошибки выполнения.
     */
    enum class Operation {
        Add,
        Subtract,
        Multiply,
        Power,
        Divide,
        Modulo,
        IntDivide,
        And,
        Or,
        BitOr,
        BitAnd,
        BitXor
    };

    /**
     * @brief Разбирает строковое представление операции и сопоставляет его с соответствующим значением перечисления `Operation`.
     *
     * Этот метод принимает строку, представляющую математический оператор или оператор сравнения, и,
     * используя предопределенное отображение, преобразует её в соответствующее значение перечисления `Operation`.
     * Если предоставленная строка не соответствует ни одному известному оператору, выбрасывается исключение.
     *
     * @param op Строковое представление оператора для разбора (например, "+", "-", "**").
     * @return Соответствующее значение перечисления `Operation` для указанного оператора.
     * @throws std::runtime_error Если входная строка не соответствует поддерживаемой операции.
     */
    static Operation parseOperation(const QString &op);
};
#endif //CPPYTHON_BINOPNODE_H